cats_api/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # GET /cats:id
    @cat = Cat.find_by(id: params[:id])

INSERT INTO "cats" ("name", "created_at", "updated_at", "skill") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Teemo"], ["created_at", "2021-01-06 04:40:35.747764"], ["updated_at", "2021-01-06 04:40:35.747764"], ["skill", "bark"]]
---
  def create
    # POST /cats
    @cat = Cat.new(cat_params)
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "skill" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Teemo"], ["skill", "Say"], ["updated_at", "2021-01-06 06:47:07.214355"], ["id", 16]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def edit
    # POST /cats/:id
    # show a form to edit an existing object
    @cat = Cat.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 15]]
---
  def destroy
    cat = Cat.find_by(id: params[:id])
    cat.destroy