cats_api/app/controllers/toys_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    cat = Cat.find_by(id: params[:cat_id])

SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Toy.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @cat = Cat.find_by(id: params[:cat_id])

SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "toys" SET "name" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["name", "President String"], ["updated_at", "2021-01-05 07:02:35.841729"], ["id", 2]]
---
  def update
    toy = Toy.find(params[:id])
    success = toy.update(toy_params)

INSERT INTO "toys" ("cat_id", "name", "ttype", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 16], ["name", "Ball Toy"], ["ttype", "ball"], ["created_at", "2021-01-06 05:24:41.864215"], ["updated_at", "2021-01-06 05:24:41.864215"]]
---
  def create
    # POST /cats/:cat_id/toys
    # POST /toys
    @toy = Toy.new(toy_params)
    @cat = @toy.cat

    if @toy.save