cats_api/app/controllers/toys_controller.rb

INSERT INTO "toys" ("cat_id", "name", "ttype", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["name", "stringy"], ["ttype", "string"], ["created_at", "2021-01-05 05:35:23.211662"], ["updated_at", "2021-01-05 05:35:23.211662"]]
---
  def create
    # POST /cats/:cat_id/toys
    # POST /toys
    toy = Toy.new(toy_params)

    if toy.save